[
  {
    "fingerprint_session_id": 1,
    "url": "https://figure.ai/news/helix",
    "key_url": "https://figure.ai/news/helix",
    "page_type": "product",
    "content_hash": "0c706078665a2438a4825da8e0219f1b063bcc50804a73264eeac2bf315ec527",
    "normalized_text_len": 14003,
    "extracted_text_preview": "Introducing Helix\nWe're introducing Helix, a generalist Vision-Language-Action (VLA) model that unifies perception, language understanding, and learned control to overcome multiple longstanding challenges in robotics. Helix is a series of firsts:\nFull-upper-body control: Helix is the first VLA to output high-rate continuous control of the entire humanoid upper body, including wrists, torso, head, and individual fingers.\nMulti-robot collaboration: Helix is the first VLA to operate simultaneously on two robots, enabling them to solve a shared, long-horizon manipulation task with items they have never seen before.\nPick up anything: Figure robots equipped with Helix can now pick up virtually any small household object, including thousands of items they have never encountered before, simply by following natural language prompts.\nOne neural network: Unlike prior approaches, Helix uses a single set of neural network weights to learn all behaviors—picking and placing items, using drawers and refrigerators, and cross-robot interaction—without any task-specific fine-tuning.\nCommercial-ready: Helix is the first VLA that runs entirely onboard embedded low-power-consumption GPUs, making it immediately ready for commercial deployment.\nNew Scaling for Humanoid Robotics\nThe home presents robotics' greatest challenge. Unlike controlled industrial settings, homes are filled with countless objects–delicate glassware, crumpled clothing, scattered toys–each with unpredictable shapes, sizes, colors, and textures. For robots to be useful in households, they will need to be capable of generating intelligent new behaviors on-demand, especially for objects they've never seen before.\nThe current state of robotics will not scale to the home without a step change. Teaching robots even a single new behavior currently requires substantial human effort: either hours of PhD-level expert manual programming or thousands of demonstrations. Both are prohibitively expensive when we consider how vast the problem of the home truly is.\nBut other domains of AI have mastered this kind of instant generalization. What if we could simply translate the rich semantic knowledge captured in Vision Language Models (VLMs) directly into robot actions? This new capability would fundamentally alter robotics' scaling trajectory (Figure 1). Suddenly, new skills that once took hundreds of demonstrations could be obtained instantly just by talking to robots in natural language. The key problem becomes: how do we extract all this common-sense knowledge from VLMs and translate it into generalizable robot control? We built Helix to bridge this gap.\nHelix: A \"System 1, System 2\" VLA for Whole Upper Body Control\nHelix is a first-of-its-kind \"System 1, System 2\" VLA model for high-rate, dexterous control of the entire humanoid upper body.\nPrior approaches face a fundamental tradeoff: VLM backbones are general, but not fast, and robot visuomotor policies are fast but not general. Helix resolves this tradeoff through two complementary systems, trained end-to-end to communicate:\nSystem 2 (S2): An onboard internet-pretrained VLM operating at 7-9 Hz for scene understanding and language comprehension, enabling broad generalization across objects and contexts.\nSystem 1 (S1): A fast reactive visuomotor policy that translates the latent semantic representations produced by S2 into precise continuous robot actions at 200 Hz.\nThis decoupled architecture allows each system to operate at its optimal timescale. S2 can \"think slow\" about high-level goals, while S1 can \"think fast\" to execute and adjust actions in real-time. For example, during collaborative behavior (see Video 2), S1 quickly adapts to the changing motions of a partner robot while maintaining S2's semantic objectives.\nHelix's design offers several key advantages over existing approaches:\nSpeed and Generalization: Helix matches the speed of specialized single-task behavioral cloning policies while generalizing zero-shot to thousands of novel test objects.\nScalability: Helix directly outputs continuous control for high-dimensional action spaces, avoiding complex action tokenization schemes used in prior VLA approaches, which have shown some success in low-dimensional control setups (e.g. binarized parallel grippers) but face scaling challenges with high-dimensional humanoid control.\nArchitectural Simplicity: Helix uses standard architectures - an open source, open weight VLM for System 2 and a simple transformer-based visuomotor policy for S1.\nSeparation of concerns: Decoupling S1 and S2 allows us to iterate on each system separately, without constraints of finding unified observation space or action representations.\nModel and Training Details\nData\nWe collect a high quality, multi-robot, multi-operator dataset of diverse teleoperated behaviors, ~500 hours in total. To generate natural language-conditioned training pairs, we use an auto-labeling VLM to generate hindsight instructions. The VLM processes segmented video clip",
    "low_text_pdf": false,
    "needs_render": false,
    "fetch_status": 200,
    "content_type": "text/html",
    "content_length": 86149,
    "processed_at": "2025-09-09T16:50:25.403215"
  },
  {
    "fingerprint_session_id": 1,
    "url": "https://figure.ai/news/botq",
    "key_url": "https://figure.ai/news/botq",
    "page_type": "product",
    "content_hash": "7e24f0941412ab7fc2880ed31abc2c0f9653bc4621be30ed562f09d41d5903b4",
    "normalized_text_len": 8587,
    "extracted_text_preview": "Introducing BotQ\nIntroducing BotQ, Figure’s new high-volume manufacturing facility for humanoid robots. BotQ’s first generation manufacturing line will be capable of manufacturing up to 12,000 humanoids per year. This is just the start and we will be scaling up considerably from here. Over the past eight months, the Figure hardware and manufacturing engineering teams have been building an efficient and scalable manufacturing process from the ground up, and we’re excited to share our progress to date.\nVertically Integrated Manufacturing: Figure has made the decision to bring the manufacturing of our humanoid robots in-house to control the build process, quality, and guarantee that we will deliver a high-functioning robot to market.\nBuilding Software Infrastructure: For the last six months, we’ve been building the underlying software infrastructure that can support volume manufacturing (MES, PLM, ERP, WMS).\nRobots Building Robots: Figure’s humanoid robots will be used in our manufacturing process to build other humanoid robots. This will take place this year. We project that the number of our humanoid robots involved will grow substantially over time to increase line automation.\nOur Roadmap To Scalable Manufacturing\nRethinking the robot architecture\nAchieving high production rate starts at the early stage of engineering design. After building and internally manufacturing Figure 02, the team recorded and analyzed cycle times for every process, from part fabrication to final assembly. The largest driver of assembly time started at the root: part count and manufacturing processes. Figure 02 was designed as a prototype and extensively used high complexity, tight tolerance, slow computer numerical control (CNC) machining processes. While CNC from billet is a great process for prototyping and holds value for high tolerance components, it does not scale well when trying to drastically reduce both part costs and time to make components. Part count was also heavily considered - if you have to join two parts, it takes time to perform that operation. Instead, if you can combine many parts into one, the cycle time goes down.\nWe have since completed the design of our next-generation robot, Figure 03, which is our production robot built for affordability and high-volume manufacturing. In order to achieve production manufacturing rates, we switched to tooled processes such as injection molding, diecasting, metal injection molding and stamping which enabled us to save thousands of hours on manufacturing. Parts that previously spent over a week on a CNC machine can now be manufactured in under 20 seconds with complex steel molds. Switching to these processes comes with a high capital cost, but the upfront investment is made back quickly when considering our robot volumes for 2025 and beyond. Rethinking the robot architecture also led us to stand up two new teams - a safety team and a reliability team.\nIn addition to manufacturing at high rates, we are also ramping up our focus on robot reliability. The reliability team, located at BotQ, is in charge of running highly accelerated lifecycle tests to help us understand the lifespan of the robot. The reliability team needs specialized equipment, including high temperature ovens, dedicated actuator testers, and failure analysis equipment to understand root cause failures. Using this data, we can inform the robot designers of improvements needed to ensure our reliability metrics are met.\nBuilding the supply chain\nHumanoid robots, unlike most other industries, do not have well established supply chains with various tiers of manufacturers building modules of the system. This has ultimately led us to design almost the entire robot from scratch including the actuators, motors, sensors, battery pack, and electronics. The lack of a mature supply chain has been one of the biggest hurdles our team has faced when defining how parts would be made and where. What would we vertically integrate, what would we choose to tackle in house? We made the decision to focus heavily on the assembly of our core technology in-house (actuators, hands, batteries, final assembly) and when needed, leverage outside vendors for piece part manufacturing. In addition, we hired a team of world-class global supply managers to help form strong partnerships with vendors who have the expertise to produce our complex components. Our robot has over 3 dozen unique commodities, many of which require unique processes such as motor winding, flexible OLED screens, or precise optical designs. All of our external partners were selected to be able to scale with us: our supply chain can easily scale to 100,000 robots or 3,000,000 actuators in the next four years.\nBuilding the manufacturing team\nThe next organization that we needed to develop was the manufacturing team. Over the last six months, we’ve hired experts who spent their careers designing lines, optimizing those lines and understanding how to optimize the process of turn",
    "low_text_pdf": false,
    "needs_render": false,
    "fetch_status": 200,
    "content_type": "text/html",
    "content_length": 52404,
    "processed_at": "2025-09-09T16:50:25.253487"
  },
  {
    "fingerprint_session_id": 1,
    "url": "https://figure.ai/culture",
    "key_url": "https://figure.ai/culture",
    "page_type": "product",
    "content_hash": "c74e2b97288100657d5281b83bc40bbbfe99a41dde2b6b4a692dda77cc9fa60d",
    "normalized_text_len": 4620,
    "extracted_text_preview": "Figure was founded with the ambition to change the world.\nOrigin\nThrough the intersection of AI and Robotics, we are building general purpose humanoid robots. These robots will eliminate the need for unsafe and undesirable jobs, allowing future generations to live happier, more purposeful lives. However, this is no easy feat — in the entirety of human history, we have not yet seen the successful commercialization of humanoid robots. The journey to build Figure at a global scale will take decades, but if successful, our team has the opportunity to make an unprecedented impact on humankind. Here, you will find Figure’s culture, as laid out in our Mission, Vision, and Values. The culture we build will make or break our future. The following values and beliefs define our identity as a company - how we work, make decisions, treat each other, and operate every day. We will hire, recognize, reward, and fire based on these cultural values. It’s important for me to disclose that our culture is not for everyone. If you believe in what you read below, then you are likely to thrive here. If you do not, Figure is not for you.\nMission\nFigure's mission is to expand human capabilities through advanced AI.\nFigure is a mission-focused company. We aspire to create a better life for future generations and will dedicate our time and resources to this pursuit.\nVision\nFigure’s vision is to deploy autonomous humanoid robots on a global scale to solve challenges within the labor economy.\nWe envision a future where humanoid robots are the universal interface in the physical world. In the early days, our humanoid will be deployed into the workforce to perform corporate tasks in areas with significant labor shortages and jobs that are undesirable or unsafe. Longer term, humanoids will play an important role in many areas such as assisting individuals in the home, caring for the elderly, and building new worlds on other planets.\nValues\nWe are looking for the overachievers — the special few who want to put a dent in this world. We are not looking for candidates seeking to minimize their workload or maximize compensation. There are plenty of high paying, cushy jobs out there — that’s not what we stand for. Our culture is deliberately cultivated to amplify high performance and to push ourselves to operate at the best of our ability every day.\nIn parallel, we will constantly fight to prevent corporate bloat — if we become bureaucratic, morale will die and so will the business. In order to achieve our mission, it is critical to stay focused. The company will always act in the best interest of humanity, behave ethically, and treat others fairly. We will not support social activism, assume negative intent, treat others unfairly, or take on causes outside of our core mission. We are all here to do one job and that is to bring an impactful, useful product to market.\nHesitation is the enemy of momentum. We are tackling today's most complex technological challenges by testing, experimenting, and taking calculated risks to embrace the unknown without fear of failure.\nOur product and our mission are one in the same: to bring a commercially viable humanoid to the market. We are builders, designers, and engineers united by a commitment to that mission, avoiding distraction and unrelated activities to remain laser-focused on shipping a safe, high quality product.\nBuilding Figure won’t be an easy win; it will require decades of commitment and ingenuity. We’re humbled by our mission, and aspire to remain optimistic even in the face of enormous hurdles.\nWe have what it takes to build the most groundbreaking company on the planet—to create an inspiring future for generations to come, with improved access to goods and services, safer working conditions, and more opportunity for fulfilling work. Our focus is on what we can achieve 5, 10, 20+ years from now, not the near-term wins.\nTo address the extraordinary demands of our work, we believe in operating as a winning team. We are in the trenches together, collaborating in-person, and pushing each other to the highest levels of performance.\nConclusion\nI am hopeful that this document will instill the importance of our culture to our current employees, as well as attract new team members with similar beliefs. Figure is a mission-focused company, and clarity around our culture will empower the team to make the highest-impact decisions for the benefit of our long-term success. If you share our commitment to building a better future, please apply on our careers page. With a strong, undivided culture, there is a potential to change the world.",
    "low_text_pdf": false,
    "needs_render": false,
    "fetch_status": 200,
    "content_type": "text/html",
    "content_length": 64366,
    "processed_at": "2025-09-09T16:50:25.290455"
  },
  {
    "fingerprint_session_id": 1,
    "url": "https://figure.ai/about-us",
    "key_url": "https://figure.ai/about-us",
    "page_type": "product",
    "content_hash": "58436003f3fbf951371989b5f6bc04eff63e4a0b5838cf66e093b56d9b5ad4e1",
    "normalized_text_len": 1550,
    "extracted_text_preview": "DESIGNING ROBOTS FOR THE REAL WORLD\nFIGURE IS ALWAYS EVOLVING.\nWe’ve completed two generations of robots in three years. Join us to build Figure 03.\nOUR VALUES\nMove Fast & Be Technically Fearless\nHesitation is the enemy of momentum. We are tackling today’s most complex technological challenges by testing, experimenting, and taking calculated risks to embrace the unknown without fear of failure.\nProduct First, Mission Focused\nOur product and our mission are one in the same: to bring a commercially viable humanoid to market. We are builders, designers, and engineers united by a commitment to that mission. We avoid distraction and unrelated activities to remain laser-focused on shipping a safe, high quality product.\nAggressively Optimistic\nBuilding Figure won’t be an easy win; it will require decades of commitment and ingenuity. We’re humbled by our mission, and aspire to remain optimistic even in the face of enormous hurdles.\nMaximize Future Impact\nWe have what it takes to build the most groundbreaking company on the planet — to create an inspiring future for generations to come with improved access to goods and services, safer working conditions, and more opportunity for fulfilling work. Our focus is on what we can achieve 5, 10, 20+ years from now, not the near-term wins.\nChampionship Mindset\nTo address the extraordinary demands of our work, we believe in operating as a winning team. We are in the trenches together, collaborating in-person, remaining hyper-focused, and pushing each other to the highest levels of performance.",
    "low_text_pdf": false,
    "needs_render": false,
    "fetch_status": 200,
    "content_type": "text/html",
    "content_length": 52251,
    "processed_at": "2025-09-09T16:50:25.218525"
  },
  {
    "fingerprint_session_id": 1,
    "url": "https://figure.ai/",
    "key_url": "https://figure.ai/",
    "page_type": "product",
    "content_hash": "f6c955cbaa918a81731f10d10d12a79aa0c944ce8f7a5f5f91c5d8494cbd476e",
    "normalized_text_len": 1361,
    "extracted_text_preview": "Figure is the first-of-its-kind AI robotics company bringing a general purpose humanoid to life.\nFIGURE IS FINALLY BRINGING ROBOTS HOME.\nFIGURE IS PUTTING LEARNING ROBOTS INTO THE GLOBAL WORKFORCE.\nFIGURE IS TAKING AN AI-FIRST APPROACH TO MARKET.\nWe’re engineering the first humanoid that can truly think for itself.\nFigure is poised to solve labor shortages. Up and running for our first commercial customers, it’s learning and performing end-to-end operations safely. Now, in the biggest innovation since the dishwasher, Figure is finally coming home. Expect Figure to do dishes and laundry, unpack groceries, and perform other household tasks 100% autonomously.\nWE’RE GIVING AI A BODY.\nWhy a human form factor?\nWe’ve designed our world for the human form. Hands allow us to open doors and use tools; arms and legs allow us to move efficiently, climb stairs, lift boxes, and more. Figure brings together the dexterity of the human form and cutting edge AI to go beyond single-function robots, lending support at home and across manufacturing, logistics, warehousing, and retail.\nSEE FIGURE IN ACTION.\n- Height\n- 5'6\"\n- Payload\n- 20kg\n- Weight\n- 70kg\n- Runtime\n- 5hr\n- Speed\n- 1.2M/S\n- System\n- Electric\nThe team bringing impossible ideas to life.\nFigure has attracted the world’s leading robotics team with over 100 years of combined AI & Humanoid experience.",
    "low_text_pdf": false,
    "needs_render": false,
    "fetch_status": 200,
    "content_type": "text/html",
    "content_length": 152598,
    "processed_at": "2025-09-09T16:50:25.374809"
  },
  {
    "fingerprint_session_id": 1,
    "url": "https://figure.ai/news",
    "key_url": "https://figure.ai/news",
    "page_type": "product",
    "content_hash": "81b74475bee8acbbd19e55cf39b1186b0b5838620e8362e8c0af9a609562d0e9",
    "normalized_text_len": 384,
    "extracted_text_preview": "Highlights\nAll News\nHelix Loads the Dishwasher\nHelix Learns to Fold Laundry\nF.03 Battery Development\nScaling Helix: a New State of the Art in Humanoid Logistics\nNatural Humanoid Walk Using Reinforcement Learning\nBotQ: A High-Volume Manufacturing Facility for Humanoid Robots\nHelix Accelerating Real-World Logistics\nHelix: A Vision-Language-Action Model for Generalist Humanoid Control",
    "low_text_pdf": false,
    "needs_render": false,
    "fetch_status": 200,
    "content_type": "text/html",
    "content_length": 38591,
    "processed_at": "2025-09-09T16:50:25.235918"
  },
  {
    "fingerprint_session_id": 1,
    "url": "https://figure.ai/ai",
    "key_url": "https://figure.ai/ai",
    "page_type": "product",
    "content_hash": "5b12fa4ab64656820700c7187d86e6b01e3aca4381457a15eba2252b445418d5",
    "normalized_text_len": 375,
    "extracted_text_preview": "Helix is a generalist humanoid Vision-Language-Action model that reasons like a human\nWE BELIEVE ARTIFICIAL INTELLIGENCE IS THE KEY TO GENERAL PURPOSE ROBOTICS.\nWE’RE BUILDING ROBOTS THAT LEARN AND REASON LIKE HUMANS.\nOUR ROBOTS WILL ACQUIRE NEW SKILLS AND IMPROVE OVER TIME.\nRead our latest technical writeups on Helix’s AI system and its real-world applications.\nThe latest",
    "low_text_pdf": false,
    "needs_render": false,
    "fetch_status": 200,
    "content_type": "text/html",
    "content_length": 144607,
    "processed_at": "2025-09-09T16:50:25.329168"
  }
]