[
  {
    "fingerprint_session_id": 12,
    "url": "https://pollen-robotics.com/personal-data-protection-charter",
    "key_url": "https://www.pollen-robotics.com/personal-data-protection-charter/",
    "page_type": "company",
    "content_hash": "aafb6cebe7697b278323ff190ef364f1dbc3cfced903e29e10bdac15ed4aec45",
    "normalized_text_len": 5855,
    "extracted_text_preview": "Pollen Robotics SAS operates in accordance with its core values: support, transparency, and honesty. We take the respect for each individual’s privacy very seriously. During your navigation on our website, you may be required to provide us with certain personal data, fragments of your private life, when you fill out our forms. Pollen Robotics SAS is committed to informing you and handling your data with full transparency, in a concise manner, using clear and simple terms.\nWe invite you to carefully read this Personal Data Protection Charter (hereinafter referred to as “The Charter”). It contains all the information regarding the data we collect and how we use it.\nThe Charter may be updated or modified based on changes to our services, tools, and regulations. We recommend that you consult it regularly.\nPersonal data refers to any information relating to an identified or identifiable natural person.\nThis data protection charter applies to all personal data you provide to us and/or that we collect, directly or indirectly, when you browse the website https://www.pollen-robotics.com (hereinafter referred to as « The Website »).\nPollen Robotics SAS collects identification data when you contact us via the website’s forms.\nThe law defines the data controller as the natural or legal person who, alone or jointly with others, determines the purposes and means of processing. In this case, it is Pollen Robotics SAS, whose head office is located at 2 Place Jean Jaurès, 33000 Bordeaux, France.\nThe data collected on Pollen Robotics SAS’s website allows us to maintain a management file of prospects, clients, or job candidates for our company.\nWe use this file for statistical purposes and to contact or offer relevant content to those who request it. If you use our forms, your objective is to request contact or seek information about our workshops.\nIf you submit your resume for an unsolicited application, we will use the personal data contained in this document for recruitment purposes.\nIn order to best monitor the interest of Pollen Robotics SAS’s prospects, clients, and candidates, the file contains all the information of visitors to https://www.pollen-robotics.com relating to identity, professional information, and activity on the website. In accordance with the French Data Protection Act, information regarding racial or ethnic origins, political, philosophical or religious opinions, trade union membership, health, or sexual orientation is not collected.\nWhen we request access to your personal data, it is and will always be for use in the context of our activities. When you give your consent, it is solely to use your data for specific actions.\nFor example:\nWe need to collect your data to better understand you and offer personalized content and services, as well as to ensure the security of our website and improve our content.\nAnonymous contact data is stored on our website for a maximum of 12 months after the last activity on https://www.pollen-robotics.com.\nHowever, for all identified contacts, excluding recruitment, the collected data is stored within the company for 60 months (to be confirmed).\nAfter these periods, the collected data related to the person will be automatically deleted.\nFor recruitment requests or unsolicited applications, https://www.pollen-robotics.com may retain your personal data for some time to contact you for future job opportunities within the company.\nIn accordance with the current law, the French Data Protection Act and the GDPR, any person may exercise their right to access, modify, withdraw, restrict the processing, and delete their data. To do so, you must make a request by email, accompanied by a copy of your identity document (which will not be retained), to contact@pollen-robotics.com. The data controller will respond within 30 days of receiving this request.\nPollen Robotics SAS is committed to not sharing your personal data with anyone outside the company. We take all necessary measures to protect your data from both a technical and organizational standpoint, particularly to safeguard its integrity against accidental loss, unauthorized access, or disclosure.\nMore generally, Pollen Robotics SAS is committed to using your data in full compliance with the General Data Protection Regulation (GDPR).\nThe data collected on https://www.pollen-robotics.com is hosted by Pollen Robotics SAS, OVH, and IP Développement. Only individuals involved in IT, communications, or HR at Pollen Robotics SAS and its partners have access to the information via secure personal access to the previously mentioned platforms.\nWhen you visit our website, we may store and use cookies in your browser to analyze your behavior on https://www.pollen-robotics.com and improve our content and your user experience.\nOnly the cookie issuer can read or modify the information it contains. If you share the use of your device with others, we cannot guarantee that the services and ads intended for your device will correspond to your o",
    "low_text_pdf": false,
    "needs_render": false,
    "fetch_status": 200,
    "content_type": "text/html",
    "content_length": 127746,
    "processed_at": "2025-09-10T09:57:49.306888"
  },
  {
    "fingerprint_session_id": 12,
    "url": "https://pollen-robotics.com/reachy-mini",
    "key_url": "https://www.pollen-robotics.com/reachy-mini/",
    "page_type": "product",
    "content_hash": "c03ba0e04b35af264b546c5b9d0b345065cb1860f68071d77c0ce18dda59b8c7",
    "normalized_text_len": 1994,
    "extracted_text_preview": "Reachy Mini is the first open-source desktop robot designed to explore human-robot interaction, and creative custom applications\nThe ideal $299 companion bot, sold as a kit to assemble yourself, ready to ship by the end of summer\nReachy Mini enables rapid prototyping of AI applications with full open-source hardware and software integration.\nEmpower your AI, robotics, and development projects with Reachy Mini which bridges simulation and real-world embodied intelligence.\nFun is the Next Frontier on Your Desk.\nUse community apps or test pre-installed ones\nYou can immediately try out pre-installed apps that come with your Reachy Mini and explore a growing library of community-developed applications.\nCustomize and Share Your Own Creations on Spaces\nGot your own ideas? Build custom apps tailored to your needs and share them with the community, where they can be liked, shared, and enjoyed by others worldwide on Spaces, the Hugging Face Hub.\nYou can also give it a try in simulation\nReachy Mini is available in simulation, so you can start prototyping your apps and testing your ideas from home right away, even before your robot arrives. Get a head start on creating amazing experiences!\nGet Notified and Become a Beta Tester\nReachy Mini will be available for pre-order starting July 9, 2025, exclusively online.\nPriced at $299, deliveries will begin in batches this fall and continue through late 2025 and into 2026\nReachy Mini Lite\n- External compute, compatible with Mac and Linux\n- Wifi not available\n- Wired power\n- 2 microphones\n- 5W speaker\n- Wide angle camera\n- No accelerometer\n- 6 degrees of freedom head movement\n- Full body rotation\n- 2 animated antennas\n- Delivery starting late summer 2025\nReachy Mini\n- Internal compute, Raspberry Pi 5\n- Wifi\n- Wireless & Battery\n- 4 microphones\n- 5W speaker\n- Wide angle camera\n- Accelerometer\n- 6 degrees of freedom head movement\n- Full body rotation\n- 2 animated antennas\n- Delivery rolling out in batches from fall 2025 through 2026",
    "low_text_pdf": false,
    "needs_render": false,
    "fetch_status": 200,
    "content_type": "text/html",
    "content_length": 148145,
    "processed_at": "2025-09-10T09:57:45.112870"
  },
  {
    "fingerprint_session_id": 12,
    "url": "https://pollen-robotics.com/reachy-2s-online-documentation",
    "key_url": "https://www.pollen-robotics.com/reachy-2s-online-documentation/",
    "page_type": "product",
    "content_hash": "cdda33940419cbd66f7da8bc241b84fc361ef594f4290eb332b5e8ae8efaec21",
    "normalized_text_len": 1863,
    "extracted_text_preview": "Resources\nFind all the essential resources to install, control, and animate your humanoid robot—either on your own Reachy 2 or entirely in simulation. Whether you’re a developer, researcher, or robotics enthusiast, step-by-step guides and tools will help you unlock Reachy 2’s full potential.\nDon’t have a Reachy yet? Click here to get one!\n🛠️ The Reachy 2 Documentation provides everything you need to get started, from the moment you unpack your robot to mastering its advanced features. You’ll find step-by-step guides for setup, basic controls, and in-depth tutorials to help you explore the full range of Reachy 2’s features.\nSet up the Reachy 2’s stack on your computer to control your humanoid robot via Jupyter Notebook or your own code. Use RViz for visualization and Gazebo or MuJoCo for simulation, before real execution.\nPrerequisite: Install Docker Desktop – no login required, the image is open-access.\nNow that you are all set, let's begin to play!\nStep-by-step tutorials\nStep-by-step notebook tutorials to help you get started, from basic behaviors to advanced control, using Reachy 2’s SDK for robot operation and Pollen-Vision for object detection.\nDisplay emotions on Reachy 2\nModule allowing Reachy 2 to show emotions via expressions, motions, and sounds, improving human-robot interaction. Help grow this project by sharing yours.\nUse AI-powered perception\nPollen-Vision is a perception library designed for robots, providing real-time object detection, pose estimation, and scene understanding to enhance robotic interactions with their environment.\nTell us about your project\nIf you need any help or want to share your project, don’t hesitate to reach out — we’d love to hear from you! You can join the conversation on our Discord, explore and contribute via GitHub, or explore our spaces on 🤗Hugging Face.\nLooking to get in touch directly?",
    "low_text_pdf": false,
    "needs_render": false,
    "fetch_status": 200,
    "content_type": "text/html",
    "content_length": 150527,
    "processed_at": "2025-09-10T09:57:45.084924"
  },
  {
    "fingerprint_session_id": 12,
    "url": "https://pollen-robotics.com/",
    "key_url": "https://www.pollen-robotics.com/",
    "page_type": "product",
    "content_hash": "c904c888693ae81a79fd0db7436f8dd4378ebbb0945a62fcb2ad38cf75574115",
    "normalized_text_len": 961,
    "extracted_text_preview": "It’s not just about good looks, it’s also about the spirit. Our vision is that the company should work for and benefit the people and the world, not the other way around.\nWe value honesty, integrity, humility and we believe that treating people right is the only good way to do business.\nJoin us on DiscordAt Pollen Robotics, we embrace open source as a collaborative model, uniting the community to advance robotics together. Since our robots interact with humans and collect data, transparency in their operation, especially regarding data protection and security, is essential.\nOpen source fosters diversity, allowing the international community to adapt Reachy 2 to specific use cases rather than creating a one-size-fits-all robot. Beyond a license, open source is a proven, collaborative approach that has shaped software and hardware infrastructures, aligning with our mission to share knowledge and drive AI innovation collectively.\nCheck out our Github",
    "low_text_pdf": false,
    "needs_render": false,
    "fetch_status": 200,
    "content_type": "text/html",
    "content_length": 112996,
    "processed_at": "2025-09-10T09:57:47.763108"
  },
  {
    "fingerprint_session_id": 12,
    "url": "https://pollen-robotics.com/reachy",
    "key_url": "https://www.pollen-robotics.com/reachy/",
    "page_type": "product",
    "content_hash": "a26dac93bc8b07c3d63d07a6c12aa88ebc211a4cb27384ff252c1b331966fdf6",
    "normalized_text_len": 951,
    "extracted_text_preview": "Use VR equipment to move Reachy 2’s arms, hands and head. See through Reachy’s cameras to interact with the environment surrounding the robot.\nWith 7 DOFs, Reachy 2’s arms feature similar dimensions, proportions and movements as in an adult human arm. One arm can lift objects up to 3 kg and manipulate them with pretty good dexterity.\nReachy 2 is available on a mobile base to get access to more applications and a wider working space. Experience the easiest navigation with three omniwheels, a cylinder-like structure, many sensors and a LiDAR.\nReachy 2’s CPU-powered system offers everything you need for machine learning, delivering strong performance and seamless compatibility with modern AI frameworks. It provides all the necessary tools to explore and implement new learning models effectively, ensuring a smooth and efficient experience.\nReachy 2 Dual Arm + Mobile Base\nReachy 2 Single Arm + Mobile Base\nReachy 2 Dual Arm\nReachy 2 Single Arm",
    "low_text_pdf": false,
    "needs_render": false,
    "fetch_status": 200,
    "content_type": "text/html",
    "content_length": 132311,
    "processed_at": "2025-09-10T09:57:48.597581"
  },
  {
    "fingerprint_session_id": 12,
    "url": "https://pollen-robotics.com/about-us",
    "key_url": "https://www.pollen-robotics.com/about-us/",
    "page_type": "company",
    "content_hash": "220b83d7ec8a2009c53fa67003f4a8ef592d05d4d29234cb471ea7cfeb6b8e22",
    "normalized_text_len": 327,
    "extracted_text_preview": "Pollen Robotics was founded in 2016 by Matthieu and Pierre, former developmental robotics researchers at Inria’s Flowers team. With over a decade of collaboration, their focus has consistently been on making robots practical and accessible. Notable successes include Poppy, the pioneering 3D printed open-source humanoid robot.",
    "low_text_pdf": false,
    "needs_render": false,
    "fetch_status": 200,
    "content_type": "text/html",
    "content_length": 134883,
    "processed_at": "2025-09-10T09:57:48.177458"
  }
]